---
title: Blend
classe: Autodesk.Revit.DB.Blend
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GenericForm
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# Blend

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BottomOffset { get; set; }` | `blend.BottomOffset` | Double |
| `CurveArrArray BottomProfile { get; }` | `blend.BottomProfile` | CurveArrArray |
| `Sketch BottomSketch { get; }` | `blend.BottomSketch` | Sketch |
| `Double TopOffset { get; set; }` | `blend.TopOffset` | Double |
| `CurveArrArray TopProfile { get; }` | `blend.TopProfile` | CurveArrArray |
| `Sketch TopSketch { get; }` | `blend.TopSketch` | Sketch |
| `VertexIndexPairArray GetVertexConnectionMap()` | `blend.GetVertexConnectionMap()` | VertexIndexPairArray |
| `Void SetVertexConnectionMap(VertexIndexPairArray)` | `blend.SetVertexConnectionMap(vertexMap)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```